---
kind: type
id: T:Autodesk.Revit.Creation.ItemFactoryBase
source: html/cba2c84a-22c0-e6e7-a99c-67656901853a.htm
---
# Autodesk.Revit.Creation.ItemFactoryBase

The ItemFactoryBase object is used to create new instances of elements within the
Autodesk Revit document.

## Syntax (C#)
```csharp
public class ItemFactoryBase : APIObject
```

## Remarks
The ItemFactoryBase object is a utility object that is used to create new
instances of elements within the Autodesk Revit document.
This class holds common methods used in both project documents and family documents.